# keyword.py
import re
from krwordrank.sentence import summarize_with_sentences
import json
from pprint import pprint

def split_sentences(text):
    sentences = text.replace(". ",".")
    sentences = re.sub(r'([^\n\s\.\?!]+[^\n\.\?!]*[\.\?!])', r'\1\n', text).strip().split("\n")
    return sentences

# text = """
# 국가에 의한 반인권적 폭력행위 등 범죄에 대한 공소시효 적용을 배제하는 내용의 법안이 31일 더불어민주당 등 야당 주도로 본회의를 통과했다.

# 이날 오후 본회의에 상정된 ‘반인권적 국가범죄의 시효 등에 관한 특례법안’은 재석의원 289인 중 찬성 179인, 반대 105인, 기권 5인으로 가결됐다. 법안은 대한민국 정부수립 이후 발생한 국가 주도의 반인권적 범죄에 대한 공소시효의 적용을 배제하고, 피해 당사자에게 국가배상청구권의 소멸시효 적용을 배제하는 내용 등을 골자로 한다.

# 법안은 앞서 국회 법제사법위원회에서 야당 주도로 처리돼 본회의에 올랐다. 이와 관련해 법사위 소속의 조배숙 국민의힘 의원은 이날 반대 토론자로 나서 “제정법임에도 불구하고 국회법에서 거치도록 정한 공청회나 청문회를 거치지 않았다”라며 “법사위에서 충분한 토론 없이 여당 의원들의 반대에도 불구하고 일방적으로 졸속 통과됐다”라고 절차적 하자를 문제삼았다.

# 또 “원래 이 법은 과거 군사정권 하에서 국가가 자행한 반인권범죄의 피해자와 그 유족이 배상을 받을 수 있도록 하자는 취지로 반인권적 국가 범죄, 또는 이를 조작·은폐한 행위의 공소시효와 민사상 손해배상 청구권을 영구 배제하는 것이 핵심”이라며 “그런데 이 법에 반인권적 국가범죄는 적용대상과 시점에 아무 제한이 없다”라고 지적했다.

# 조 의원은 “이를 근거로 공소시효와 소멸시효 적용을 배제하는 것은 도리어 수사 공무원의 인권을 탄압할 수 있다”라며 “특히 공무원의 직권남용 등이 반인권적 국 가범죄 범위에 포함돼 있어서 피해자 또 는 유죄가 확정된 범죄자들이 담당 수사관에게 보복성 고소, 고발을 남발할 수 있게 된다”라고 우려했다.

# 반면 법사위 소속 서영교 민주당 의원은 찬성 토론에서 “반인권적 국가범죄에 대해서 공소시효를 배제하는 것은 국민의 명령이자 정의의 실현”이라며 “수없이 많은 사람들을 죽음으로 내몰고 중상해를 입히고 이러한 범죄에 대해서는 이제 공소시효를 없애는 것이 22대 우리 국회의 할 일”이라고 말했다.

# 서 의원은 “어느 수사관이 혼자서 그 일(사건 조작)을 하겠습니까. 어느 경찰이, 어느 검사가 혼자서 하겠습니까”라며 “윤석열과 같은 집단이 시켰기 때문 아니겠습니까”라고도 했다. 이어 “바로 위에서 조직적으로 명령을 내렸기 때문 아니겠습니까”라며 “국가기관이 저지른 폭력으로 사망 당하거나 상해를 입혔을 때는 공소시효를 없애놔야 더 이상 이런 조직적인 범죄는 일어나지 않을 것”이라고 덧붙였다.

# 이날 본회의에서는 ‘고위공직자범죄수사처 설치 및 운영에 관한 법률 일부개정법률안’도 재석의원 290인 중 찬성 243인, 반대 31인, 기권 16인으로 가결됐다. 개정안은 공수처 검사의 임용 조건을 법조 경력 7년에서 5년으로 완화하는 내용을 담고 있다.
# """

text = """
황윤기 이도흔 기자 = 헌법재판소가 한덕수 국무총리 탄핵심판 및 권한쟁의심판 사건의 심리를 개시하면서 재판관 3명의 공석을 채워줄 것을 재차 촉구했다.
이진 헌재 공보관은 31일 정기 브리핑에서 "국무총리 탄핵심판 사건을 변론준비 절차에 회부하고 김복형·김형두 재판관을 수명재판관으로 지정했다"고 밝혔다.
수명재판관은 변론 준비 절차를 진행하고 증거 조사 등을 담당하는 역할을 한다.
헌재는 아울러 국민의힘 의원들이 한 총리 탄핵안 가결이 부당하다며 제기한 권한쟁의심판 사건을 탄핵심판과 쟁점 등이 유사한 사건으로 보고, 두 사건을 같은 주심 재판관에 배당했다. 주심 재판관은 공개하지 않았다.
이 공보관은 "대통령 탄핵심판 사건을 탄핵 사건 중 최우선으로 처리한다는 방침은 유지한다"고 설명했다.
이 같은 내용은 전날 열린 재판관 회의에서 결정됐다. 재판관들은 아울러 "헌재의 조속한 완성을 촉구한다"는 입장을 냈다.
천재현 부공보관은 질의응답에서 "헌재는 지난 10월 공석 발생 이후 일관된 입장으로 재판관 3명의 조속한 충원을 바란다고 밝혀왔다"며 "재판관 공석이 보충돼야 정상적인 상태에서 권한대행 사건을 포함한 여러 사건의 신속하고 공정한 재판이 가능하다는 점을 깊이 살펴봐 달라"고 했다.
최근 접수된 탄핵 사건들은 문형배 헌재소장 권한대행을 제외한 5명 재판관에게 무작위로 배당됐다. 재판관별로 1∼4건의 탄핵심판을 주심으로 배당받은 상황이라고 한다.
헌재는 다음 달 1일부터 재판관들에 대한 경호와 보안을 강화하기로 했다. 이에 따라 재판관들에 대한 아침 출근길 취재와 촬영 등도 중단한다는 방침이다.
헌재는 전날 윤 대통령 탄핵 사건과 관련해 중앙선거관리위원장에게 기록인증등본 송부촉탁(발송 요청)을 송달했다. 천 부공보관은 "변론준비기일의 원활한 진행을 위해 일부 절차가 진행 중"이라고 밝혔다.
이날 윤 대통령 측에서 체포영장 발부와 관련해 권한쟁의심판을 제기하겠다고 한 것에 대해서는 "아직 접수 전이라 구체적 내용을 파악하기 어렵다"고 했다.
무안공항 제주항공 여객기 참사와 관련해 경찰이 본격적인 수사에 나섰습니다.
전남경찰청 수사본부는 오늘(2일) 오전 9시부터 무안공항 2개 부서 사무실과 부산지방항공청 무안출장소, 김포공항 내에 위치한 제주항공 서울 사무소 등 3곳에서 압수수색을 진행하고 있습니다.
경찰의 이번 압수수색은 이번 참사와 관련해 여객기 운항이 규정에 맞게 이뤄졌는지, 정비가 제대로 이뤄졌는지, 시설 등이 법과 규정에 맞게 지어지고 유지됐는지 확인하기 위한 수사 기초 자료를 확보하기 위해서입니다.
경찰 관계자는 "이번 참사와 관련해 전반적인 사항들을 모두 살펴볼 것"이라고 말했습니다.
트럼프 당선인은 협상과 담판을 좋아하고 사업가적 기질이 뚜렷한 인물로 정평이 나 있습니다.
바이든 대통령과 비교하면 민주주의 가치와 이를 중심으로 한 민주 진영의 연대를 소홀히 하는 면모도 보입니다.
왕후이야오 박사의 표현에 따르면 '이데올로기가 없다'는 건데, 왕 박사는 바로 이 점 때문에 양안 문제에서 중국과 미국이 새롭게 입장을 조율해 나갈 수 있을 것으로 기대를 표명했습니다.
반면 궈위런 부원장은 이데올로기와 무관하게 트럼프의 대중 압박 시나리오에서 타이완의 전략적 가치는 매우 중요하다고 설명합니다.
트럼프 행정부 1기였던 2019년 6월 미국 국방부는 '인도-태평양 전략'을 발표하고 중국이 인태지역의 패권을 차지하려 한다며 중국을 견제해 이를 막아낼 것임을 분명히 했습니다.
궈 부원장의 견해는 이 같은 트럼프의 기조가 변함이 없다는 판단에 기인합니다.
궈 부원장은 "트럼프는 중국을 가장 큰 전략적 위협으로 보고 있다"며, 트럼프의 당선이 중국과 타이완 어느 쪽에 더 유리하냐는 질문에 "중국에 매우 불리하다"고 강조했습니다.
"""

sentence_list = split_sentences(text)

print("\n=== 전처리된 문장 ===")
for sentence in sentence_list:
    print(f"문장: {sentence}")

# 키워드 추출
keywords, sents = summarize_with_sentences(
    sentence_list, 
    num_keywords=100, 
    num_keysents=10
)

print("\n=== 키워드 추출 결과 (상위 10개) ===")
print(f"{'키워드':<10} {'점수':>10}")
print("-" * 25)
for word, score in sorted(keywords.items(), key=lambda x: x[1], reverse=True)[:10]:
    print(f"{word:<10} {score:>10.4f}")